public/man/man1/systemd-tty-ask-password-agent.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - systemd-tty-ask-password-agent.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - systemd-tty-ask-password-agent.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>systemd-tty-ask-password-agent - List or process pending systemd
password requests</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>systemd-tty-ask-password-agent</strong> [OPTIONS…] [VARIABLE=VALUE…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>systemd-tty-ask-password-agent</strong> is a password agent that handles
password requests of the system, for example for hard disk encryption
passwords or SSL certificate passwords that need to be queried at
boot-time or during runtime.</p>
<p>
<strong>systemd-tty-ask-password-agent</strong> implements the <strong>Password Agents
Specification</strong>[1], and is one of many possible response agents which
answer to queries formulated with *systemd-ask-password*(1).</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>–list</strong></p>
<blockquote>
<p>Lists all currently pending system password requests.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<strong>–query</strong></p>
<blockquote>
<p>Process all currently pending system password requests by querying the
user on the calling TTY.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<strong>–watch</strong></p>
<blockquote>
<p>Continuously process password requests.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<strong>–wall</strong></p>
<blockquote>
<p>Forward password requests to *wall*(1) instead of querying the user on
the calling TTY.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<strong>–plymouth</strong></p>
<blockquote>
<p>Ask question with *plymouth*(8) instead of querying the user on the
calling TTY.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<strong>–console</strong>[=/DEVICE/]</p>
<blockquote>
<p>Ask question on TTY <em>DEVICE</em> instead of querying the user on the calling
TTY. If <em>DEVICE</em> is not specified, /dev/console will be used.</p>
<p>
Added in version 186.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Print a short help text and exit.</p>
</blockquote>
<p>
<strong>–version</strong></p>
<blockquote>
<p>Print a short version string and exit.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXIT STATUS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>On success, 0 is returned, a non-zero failure code otherwise.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*systemd*(1), *systemctl*(1), *systemd-ask-password-console.service*(8),
*wall*(1), *plymouth*(8)</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
NOTES
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<dl>
<dt>
1.
</dt>
<dd>Password Agents Specification

https://systemd.io/PASSWORD_AGENTS/</dd>
</dl>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
